const getMainSystems = () => {
  return Promise.resolve({
    bottomSystem: [[{
      id: 101,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]
    }, {id: 102,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}, {id: 103,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}], [{id: 1001,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}, {id: 104,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}, {id: 105,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}], [{id: 106,
      acceptData: [30, 32, 30, 34, 39, 30, 32],
      handleData: [10, 12, 11, 14, 40, 20, 20],
      finishData: [22, 12, 11, 34, 20, 30, 30]}, {id: 107,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}, {id: 108,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}], [{id: 109,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}, {id: 110,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}, {id: 111,
      acceptData: [320, 332, 301, 334, 390, 330, 320],
      handleData: [120, 132, 101, 134, 90, 230, 210],
      finishData: [220, 182, 191, 234, 290, 330, 310]}]],
    middleSystem: [{id: 201,
      data: [
        {value: 335, name: '供应链'},
        {value: 310, name: '新城物业'},
        {value: 234, name: '电子交易中心'},
        {value: 135, name: '房地产公司'},
        {value: 1548, name: '热电厂'},
        {value: 548, name: '城投公司'},
        {value: 348, name: '集团本部'},
        {value: 748, name: '东方英语'}
      ]}, {id: 202}, {id: 203}],
    topSystem: {
      level1: [{id: 301}, {id: 302}, {id: 303}],
      level2: [{id: 304}, {id: 305}, {id: 306}]
    }
  })
}

export default {
  getMainSystems
}
